Revit 2026 API

# NeutralMode Enumeration

---

An enumerated type to list the neutral mode for wire type.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum NeutralMode
```
```vb
Public Enumeration NeutralMode
```
```cpp
public enum class NeutralMode
```
```fsharp
type NeutralMode
```

| Member name | Value | Description |
| --- | --- | --- |
| HotConductorSize | 0 | Neutral Mode is HotConductorSize. |
| UnbalancedCurrent | 1 | Neutral Mode is UnbalancedCurrent. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace